/**
  @author 202424502061 付强
  @version 1.0
  jdk 21.0.7
*/

java的特点
  java健壮的保证：强类型机制、异常处理、垃圾的自动收集
  java语面向对象(oop)
  跨平台（依靠JVM）//JVM帮助做解释、翻译的工作
  解释型语言      //解释性语言:js、php、java
                 //编译性语言：c\cpp
                 //解释型语言编译后的代码需要解释器才能被执行
强类型机制：每个变量和表达式在编译时有确定的类型，如果不匹配直接报错
异常处理：提供一套结构化的机制来捕获和处理程序运行时的错误，防止程序崩溃
垃圾自动收集：自动回收不再受用的内存对象，无需手动管理内存

JVM运行机制及运行过程
   不同操作系统需要的JVM不同
   JVM包含在JDK中
   JVM实现“一次编译、到处运行”

  test.java ——(编译javac)—— test.class ——(运行)—— JVM FOR ......

JDK = JRE(运行环境) + Java开发工具
JRE = JVM　+  核心类库

    思考：Java核心类库有哪些
    
Java算法与数据结构
    数据结构：研究非数值计算的程序问题中的操作对象，以及他们之间的关系和操作问题
    就是把数据元素按照一定关系组织起来的集合（组织和存储数据）

    逻辑结构：从具体结构中抽离出来的模型，按照对象中数据元素之间的相互关系分类
        集合结构：除属同一个集合中外之间无任何关系
        线性结构：
        树形结构：
        图形结构：

    物理结构（映像/存储结构）：逻辑结构在计算机中真正的表达方式
        顺序存储结构：把数据元素放到地址连续的存储单元里面，其数据间的逻辑关系核物理关系是一致的（例如数组）
        链式存储结构：把数据元素存放在任意的存储单元里，地址可连续可不连续
                     数据之间不能反映元素间的逻辑关系
                     引进指针（伪概念）存放数据元素的地址
    算法：解题方案的准确而完整的描述
          根据一定条件，对一些数据进行计算，得到需要的结果
数据结构三要素


什么是软件
    按照特定顺序组织的计算机数据和指令的结合；
    分为系统软件和应用软件；

常见的DOS命令：
    DOS：磁盘操作系统；
    进入CMD；
    D：                        //进入D盘
    dir:                       //目录
    md(make directory) cmd1    //创建名为cmd1的文件
    cd cmd1                    //进入指定目录(cmd1)；
    cd..                       //回到上层目录
    cd cmd/class1/team1        //(一步到位)进入team1；
    rd(remove)                 //移除
    del/del *.txt              //移除txt文件
    
如果编码错误，从UTF-8改为ANSI
ANSI就是GBK；

java框架

public class helloworld{                        //一个源文件中可以声明多个类，但只允许一个类使用public
  public static void main(String[] args){       //使用public的类需与源文件名相同；
    System.out.println("helloworld!");
    }
}
class:关键字，表示“类”，后面＋类名;
main()的方法是固定的                               //表示程序入口
String[]表示数组
args是一个名字                                     //可以动，也可改为String a[];
执行语句必须加“；”
println与print的区别：println输出后会换行；          //先输出后换行

编译说明：
  在编译时，路径与文件名正确，文件名不区分大小写         //Windows系统不区分大小写
  如果文件中存在语法错误，可能导致编译不通过；
  编译后会生成一个或多个字节码文件，每一个字节码对应一个类Java；
  每个字节码文件和与之对应的类名相同；

运行说明：
   update：编译时javac 字节码文件名.java
   在运行时严格遵循大小写                 //因为是java层面，表示解释运行某个类；
   可能运行出现异常                      //例如“ptintln(10/0)”，语法没问题但实现不了
   在同一个路径下，不能类重复
   
  
窝草机制                               //不知道哪个神人研究出来的
  eg:一个文件内包含“helloworld”与“HELLLOWORLD”两个类会怎样
  结果:javac过了，但在“下面”的类会覆盖“上面的类”，如果运行上面的会报错；    
                                      //字节码文件名会用“上面类”的
  
有的同学会配置class path变量，要删掉
否则编译的时候不会在原路径找，系统会去path路径找    //尽量comment

javadoc -d mydir -author -version HelloWorld.java
        //以网页格式解析文档，生成有关类的介绍信息

API(应用程序编程接口)：java提供的基本接口
Java API文档：JDK使用说明书







  
